# Напишите программу для вычисления и вывода суммы квадратов элементов списка numbers.

def reduce(func, iter_obj, start_acc_value):
    acc = start_acc_value
    for item in iter_obj:
        acc = func(acc, item)
    return acc


def sum_square(x, y):
    return x + y**2


if __name__ == "__main__":
    
    numbers = [97, 42, 9, 32, 3, 45, 31, 77, -1, 11, -2, 75, 5, 51, 34, 28, 46, 1, -8, 84, 16, 51, 90, 56, 65, 90,
               23, 35, 11, -10, 70, 90, 90, 12, 96, 58, -8, -4, 91, 76, 94, 60, 72, 43, 4, -6, -5, 51, 58, 60, 30,
               38, 67, 62, 36, 72, 34, 82, 62, -1, 60, 82, 87, 81, -7, 57, 26, 36, 17, 43, 80, 40, 75, 94, 91, 64,
            38, 72, 29, 84, 38, 35, 7, 54, 31, 95, 78, 27, 82, 1, 64, 94, 31, 29, -8, 98, 24, 61, 7, 73]
    print(reduce(sum_square, numbers, 0))
