# Напишите программу, которая с помощью функций filter() и map()
# отбирает из заданного списка numbers трехзначные числа, дающие при делении на
# 5 остаток 2, и выводит их кубы, каждый на отдельной строке.
# Примечание. Остаток 2 при делении на 5 должно давать само число, а не его куб.


def filter(func, iter_obj):
    result = []
    for item in iter_obj:
        if func(item):
            result.append(item)
    return result


def three_digit(number):
    return 99 < number < 1000 and number % 5 == 2


def cube(number):
    return number**3


def map(func, iter_obj):
    result = []
    for item in iter_obj:
        result.append(func(item))
    return result


if __name__ == "__main__":
    numbers = [1014, 1321, 675, 1215, 56, 1386, 1385, 431, 1058, 486, 1434, 696, 1016, 1084, 424, 1189, 475,
               95, 1434, 1462, 815, 776, 657, 1225, 912, 537, 1478, 1176, 544, 488, 668, 944, 207, 266, 1309,
               1027, 257, 1374, 1289, 1155, 230, 866, 708, 144, 1434, 1163, 345, 394, 560, 338, 232, 182, 1438,
               1127, 928, 1309, 98, 530, 1013, 898, 669, 105, 130, 1363, 947, 72, 1278, 166, 904, 349, 831, 1207,
               1496, 370, 725, 926, 175, 959, 1282, 336, 1268, 351, 1439, 186, 273, 1008, 231,
               138, 142, 433, 456, 1268, 1018, 1274, 387, 120, 340, 963, 832, 1127]
    
    result = map(cube, filter(three_digit, numbers))
    print(*result, sep="\n")
    